tutorials/eulerVortex.simple.enforced/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
7606
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    emptyPatches_empt
    {
        type            fixedValue;
        value           uniform 1;
    }
    top_cyc
    {
        type            fixedValue;
        value           uniform 1;
    }
    bottom_cyc
    {
        type            fixedValue;
        value           uniform 1;
    }
    inlet_cyc
    {
        type            fixedValue;
        value           uniform 1;
    }
    outlet_cyc
    {
        type            fixedValue;
        value           uniform 1;
    }
}


// ************************************************************************* //
